## Using Null

Data Summary

Table: **teacher**

**id**  : serves as a unique identifier for each teacher <br>
**dept** : represents the department to which the teacher is affliated <br>
**name** : holds the name of the teacher <br>
**phone** : stores the phone number of the teacher <br>
**mobile** : stores the mobile number of the teacher <br>

Table: **dept**

**id** :serves as a unique identifier for id <br>
**name** : holds the name of the department <br>

In [19]:
from query import query

#### NULL, INNERJOIN, LEFTJOIN, RIGHTJOIN

#### **1.**

List the teachers who have NULL for their department.

In [3]:
query("SELECT name FROM teacher WHERE dept IS NULL;")

         name
0  Spiregrain
1    Deadyawn

#### **2.**

Note the INNER JOIN misses the teachers with no department and the departments with no teacher.

In [5]:
query("""
    SELECT teacher.name, dept.name
    FROM teacher INNER JOIN dept
    ON (teacher.dept=dept.id)

""")

        name       name
0   Shrivell  Computing
1      Throd  Computing
2     Splint  Computing
3  Cutflower     Design

#### **3.**

Use a different JOIN so that all teachers are listed.

In [6]:
query("Select teacher.name, dept.name from teacher left join dept on (teacher.dept=dept.id);")

         name       name
0    Shrivell  Computing
1       Throd  Computing
2      Splint  Computing
3  Spiregrain       None
4   Cutflower     Design
5    Deadyawn       None

#### **4.**

Use a different JOIN so that all departments are listed.

In [7]:
query("Select teacher.name, dept.name from teacher right join dept on (teacher.dept=dept.id)")

        name         name
0   Shrivell    Computing
1      Throd    Computing
2     Splint    Computing
3  Cutflower       Design
4       None  Engineering

#### **5.**

Use COALESCE to print the mobile number. Use the number '07986 444 2266' if there is no number given. Show teacher name and mobile number or '07986 444 2266'

In [8]:
query("SELECT name, COALESCE(mobile, '07986 444 2266') FROM teacher;")

         name COALESCE(mobile, '07986 444 2266')
0    Shrivell                     07986 555 1234
1       Throd                     07122 555 1920
2      Splint                     07986 444 2266
3  Spiregrain                     07986 444 2266
4   Cutflower                     07996 555 6574
5    Deadyawn                     07986 444 2266

#### **6.**

Use the COALESCE function and a LEFT JOIN to print the teacher name and department name. Use the string 'None' where there is no department.

In [9]:
query("""SELECT teacher.name, coalesce(dept.name, 'None') 
        FROM teacher LEFT JOIN dept 
        ON (teacher.dept=dept.id)""")

         name coalesce(dept.name, 'None')
0    Shrivell                   Computing
1       Throd                   Computing
2      Splint                   Computing
3  Spiregrain                        None
4   Cutflower                      Design
5    Deadyawn                        None

#### **7.**

Use COUNT to show the number of teachers and the number of mobile phones.

In [11]:
query("SELECT count(name) nameCount, count(mobile) mobileCount from teacher;")

   nameCount  mobileCount
0          6            3

#### **8.**

Use COUNT and GROUP BY dept.name to show each department and the number of staff. Use a RIGHT JOIN to ensure that the Engineering department is listed.

In [13]:
query("""
        SELECT dept.name, COUNT(teacher.name) teacherCount FROM teacher RIGHT JOIN dept ON (teacher.dept=dept.id) GROUP BY dept.name;
""")

          name  teacherCount
0    Computing             3
1       Design             1
2  Engineering             0

#### **9.**

Use CASE to show the name of each teacher followed by 'Sci' if the teacher is in dept 1 or 2 and 'Art' otherwise.

In [16]:
query("""
    SELECT name,
   CASE
      WHEN dept IN (1,2) THEN 'Sci'
      ELSE 'Art'
   END 'Art or Sci'
FROM teacher;

""")

         name Art or Sci
0    Shrivell        Sci
1       Throd        Sci
2      Splint        Sci
3  Spiregrain        Art
4   Cutflower        Sci
5    Deadyawn        Art

#### **10.**

Use CASE to show the name of each teacher followed by 'Sci' if the teacher is in dept 1 or 2, show 'Art' if the teacher's dept is 3 and 'None' otherwise.

In [18]:
query("""
        SELECT name,
   CASE
      WHEN dept IN (1,2) THEN 'Sci'
      WHEN dept = 3 THEN 'Art'
      ELSE 'None'
   END 'Art/Sci/None'
FROM teacher;

""")

         name Art/Sci/None
0    Shrivell          Sci
1       Throd          Sci
2      Splint          Sci
3  Spiregrain         None
4   Cutflower          Sci
5    Deadyawn         None